### Agenda: 


* Creating Dataframe from
    
    - Dictionary
    
    - List
    
    - Numpy Array

---

In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os

---

#### In Creating Dataframe from Dictionary

In [2]:
pd.DataFrame({'id': [1,2,3,4], 
              'Name':['Miko', 'John', 'James', 'Nina']}, 
             columns=['id', 'Name'])

   id   Name
0   1   Miko
1   2   John
2   3  James
3   4   Nina

#### In Creating Dataframe from List

In [3]:
pd.DataFrame([[1,'Miko'],[2,'John'],[3, 'James'], [4, 'Nina']])

   0      1
0  1   Miko
1  2   John
2  3  James
3  4   Nina

#### In Creating Dataframe from Numpy Array

In [4]:
num = np.random.rand(3,6)

In [5]:
pd.DataFrame(num)

          0         1         2         3         4         5
0  0.844402  0.417233  0.478737  0.488972  0.452813  0.293128
1  0.444219  0.147542  0.943370  0.817838  0.642073  0.457997
2  0.547570  0.630971  0.993078  0.896158  0.747560  0.135221

---

In [7]:
# arange(1,11,1) - create number range from 1 to 10 with an increment/step of 1
# randinit(0,101,10) = create a random interger, minimum of 0 to max of 101 
# and a total of 10 values need to be generated

pd.DataFrame({'id':np.arange(1,11,1), 'grades':np.random.randint(0,101,10)}, columns=['id', 'grades'])

   id  grades
0   1      64
1   2      85
2   3      66
3   4      55
4   5      66
5   6      10
6   7      48
7   8      57
8   9      85
9  10      90

---

#### Creating Dataframe from Series

In [10]:
data = pd.DataFrame({'country_id': [1,2,3], 'country':['Germany', 'France', 'Singapore']}, 
                    index=['gr','fr','sg'],
                   columns=['country_id', 'country'])

In [11]:
data

    country_id    country
gr           1    Germany
fr           2     France
sg           3  Singapore

In [12]:
capitals = pd.Series(['Berlin', 'Paris'], index=['gr', 'fr'], name='capital')

In [13]:
capitals

gr    Berlin
fr     Paris
Name: capital, dtype: object

In [14]:
pd.concat([data, capitals], axis=1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    country_id    country capital
fr           2     France   Paris
gr           1    Germany  Berlin
sg           3  Singapore     NaN